// class Game {
//     constructor() {
//         this.init();
//     }
//     init(){
//         this.init_data=[["香\n車:1","桂\n馬:1","銀\n将:1","金\n将:1","王\n将:1","金\n将:1","銀\n将:1","桂\n馬:1","香\n車:1"],[,"飛\n車:1",,,,,,"角\n行:1",],["歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1","歩\n兵:1"],[,,,,,,,,],[,,,,,,,,],[,,,,,,,,],["歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1","歩\n兵:-1"],[,"角\n行:-1",,,,,,"飛\n車:-1",],["香\n車:-1","桂\n馬:-1","銀\n将:-1","金\n将:-1","王\n将:-1","金\n将:-1","銀\n将:-1","桂\n馬:-1","香\n車:-1"]];
//         this.captured_piece=[["歩\n兵:0",'飛\n車:0','角\n行:0','香\n車:0','桂\n馬:0','銀\n将:0','金\n将:0'],["歩\n兵:0",'飛\n車:0','角\n行:0','香\n車:0','桂\n馬:0','銀\n将:0','金\n将:0']]
//         this.piece_choise=[];
//         this.now_point=[];
//         this.game_turn=0;
//         this.player_turn;
//         this.play_data = this.init_data;
//         this.breadth=40;
//     }
//     draw(){
//         background(242,182,109);
//         fill(242,182,109);
//     }
//   }
  
// let borad = new Game();
